workstation/openfoam-master-tutorials/tutorials/heatTransfer/chtMultiRegionFoam/windshieldDefrost/0.orig/cabin/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (-2 0 0);
    }

    outlet
    {
        type            pressureInletOutletVelocity;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }

    symmetry
    {
        type            symmetryPlane;
    }

    walls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    cabin_to_ice
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
